title: Kerberoasting Service Ticket Request
id: 33cbf65a-d1b6-4a38-824e-83b998f51a7f
status: experimental
description: Detects Kerberos service ticket requests excluding machine accounts.
author: Ilya Salkaev
date: 2026-07-17

logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4769

  filter_machine_accounts:
    TargetUserName|re: '.*\$@.*'

  condition: selection and not filter_machine_accounts

falsepositives:
  - Normal Kerberos authentication
  - Service accounts
  - Administrative tools

level: low

tags:
  - attack.credential_access
  - attack.t1558.003